/*
P0.0:RX3    P1.0:L9_L   P2.0		P3.0:RX1    P4.0:L1_L   P5.0:L3_H   P6.0		P7.0:L6_L
P0.1:TX3    P1.1:L8_L   P2.1		P3.1:TX1    P4.1:220v_1 P5.1:L4_L   P6.1:L12_L  P7.1:L6_H
P0.2:RX4    P1.2		P2.2:PWM7   P3.2:INT0   P4.2:220v_2 P5.2		P6.2:L11_L  P7.2:L7_L
P0.3:TX4    P1.3:L11_H  P2.3:PWM8   P3.3:L2_H   P4.3:220v_3 P5.3        P6.3:L10_L  P7.3:L7_H
P0.4：T1    P1.4        P2.4		P3.4:L3_L   P4.4:220v_4 P5.4:L12_H  P6.4		P7.4
P0.5：T2    P1.5        P2.5		P3.5:L4_H   P4.5		P5.5		P6.5:L1_H   P7.5:buzzer
P0.6：T3    P1.6:L9_H   P2.6:24V_1  P3.6:L5_L   P4.6		P5.6		P6.6		P7.6:DR3
P0.7        P1.7:L10_H  P2.7:24V_2  P3.7:L5_H   P4.7:L8_H   P5.7		P6.7:L2_L   P7.7:DR4
                                                                                        */

#include "gpio.h"

void GPIO_Init( void )
{
    P0M0 = 0x0a;    P0M1 = 0x70;        // P0.1 0.3为推挽 P0.4、0.5、0.6为高阻输入

    P1M0 = 0x00;    P1M1 = 0X00;        //P1.0、P1.1、P1.3、P1.6、P1.7上拉电阻
    P1PU = 0xcb; 

    P2M0 = 0xcc;    P2M1 = 0x00;        //2.2 2.3  2.6 2.7为推挽   

    P3M0 = 0x02;    P3M1 = 0x00;        //3.1、3.2为推挽  3.3、3.4、3.5、3.6、3.7上拉电阻
    P3PU = 0xf8; 

    P4M0 = 0x1e;    P4M1 = 0x00;        //P4.1、4.2、4.3、4.4为推挽 4.0、4.7上拉电阻   
    P4PU = 0x81; 

    P5M0 = 0x01;    P5M1 = 0X00;        //P5.0、5.1、5.4上拉电阻   
    P5PU = 0x13; 

    P6M0 = 0x10;    P6M1 = 0X00;        //P6.1、6.2、6.3、6.5、6.7上拉电阻   
    P6PU = 0xae; 

    P7M0 = 0x60;    P7M1 = 0X00;        //P7.5为推挽 7.0、7.1、7.2、7.3上拉电阻   
    P7PU = 0x0f; 
}
  